{
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "This configuration policy is the security configuration recommended as a standard for organization owned devices where users access more sensitive information.",
    "displayName":  "Android - Fully managed enhanced security configuration (Level 2)",
    "accountsBlockModification":  null,
    "appsAllowInstallFromUnknownSources":  null,
    "appsAutoUpdatePolicy":  "wiFiOnly",
    "appsDefaultPermissionPolicy":  null,
    "appsRecommendSkippingFirstUseHints":  null,
    "bluetoothBlockConfiguration":  null,
    "bluetoothBlockContactSharing":  null,
    "cameraBlocked":  null,
    "cellularBlockWiFiTethering":  null,
    "certificateCredentialConfigurationDisabled":  true,
    "microsoftLauncherConfigurationEnabled":  null,
    "enrollmentProfile":  "notConfigured",
    "dataRoamingBlocked":  null,
    "dateTimeConfigurationBlocked":  null,
    "factoryResetDeviceAdministratorEmails":  [
                                                  "example@gmail.com"
                                              ],
    "factoryResetBlocked":  true,
    "globalProxy":  null,
    "googleAccountsBlocked":  true,
    "kioskModeScreenSaverConfigurationEnabled":  null,
    "kioskModeScreenSaverImageUrl":  null,
    "kioskModeScreenSaverDisplayTimeInSeconds":  null,
    "kioskModeScreenSaverStartDelayInSeconds":  null,
    "kioskModeScreenSaverDetectMediaDisabled":  null,
    "kioskModeWallpaperUrl":  null,
    "kioskModeExitCode":  null,
    "kioskModeVirtualHomeButtonEnabled":  null,
    "kioskModeVirtualHomeButtonType":  null,
    "kioskModeBluetoothConfigurationEnabled":  null,
    "kioskModeWiFiConfigurationEnabled":  null,
    "kioskModeFlashlightConfigurationEnabled":  null,
    "kioskModeMediaVolumeConfigurationEnabled":  null,
    "microphoneForceMute":  null,
    "networkEscapeHatchAllowed":  null,
    "nfcBlockOutgoingBeam":  null,
    "passwordBlockKeyguard":  null,
    "passwordBlockKeyguardFeatures":  [

                                      ],
    "passwordExpirationDays":  365,
    "passwordMinimumLength":  6,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordCountToBlock":  5,
    "passwordRequiredType":  "numericComplex",
    "passwordSignInFailureCountBeforeFactoryReset":  5,
    "playStoreMode":  null,
    "safeBootBlocked":  true,
    "screenCaptureBlocked":  null,
    "securityAllowDebuggingFeatures":  null,
    "securityRequireVerifyApps":  true,
    "statusBarBlocked":  null,
    "stayOnModes":  [

                    ],
    "storageAllowUsb":  null,
    "storageBlockExternalMedia":  true,
    "storageBlockUsbFileTransfer":  true,
    "systemUpdateWindowStartMinutesAfterMidnight":  null,
    "systemUpdateWindowEndMinutesAfterMidnight":  null,
    "systemUpdateInstallType":  "automatic",
    "systemWindowsBlocked":  null,
    "usersBlockAdd":  true,
    "usersBlockRemove":  true,
    "volumeBlockAdjustment":  null,
    "vpnAlwaysOnLockdownMode":  false,
    "vpnAlwaysOnPackageIdentifier":  "",
    "wifiBlockEditConfigurations":  null,
    "wifiBlockEditPolicyDefinedConfigurations":  null,
    "kioskModeApps":  [

                      ]
}
