{
    "@odata.type":  "#microsoft.graph.iosDeviceFeaturesConfiguration",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "",
    "displayName":  "iOS - Features",
    "assetTagTemplate":  null,
    "contentFilterSettings":  null,
    "lockScreenFootnote":  null,
    "wallpaperDisplayLocation":  "notConfigured",
    "wallpaperImage":  null,
    "singleSignOnExtension":  null,
    "iosSingleSignOnExtension":  null,
    "airPrintDestinations":  [

                             ],
    "homeScreenDockIcons":  [

                            ],
    "homeScreenPages":  [

                        ],
    "notificationSettings":  [

                             ],
    "singleSignOnSettings":  {
                                 "allowedUrls":  [
                                                     "https://wac-thecliffords.msappproxy.net/"
                                                 ],
                                 "displayName":  "iOS - Features",
                                 "kerberosPrincipalName":  "userPrincipalName",
                                 "kerberosRealm":  "cliffnet.the-cliffords.com",
                                 "allowedAppsList":  [

                                                     ]
                             }
}
