{
    "@odata.type":  "#microsoft.graph.macOSDeviceFeaturesConfiguration",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  "",
    "displayName":  "OSX - Features",
    "adminShowHostInfo":  false,
    "loginWindowText":  null,
    "authorizedUsersListHidden":  false,
    "authorizedUsersListHideLocalUsers":  false,
    "authorizedUsersListHideMobileAccounts":  false,
    "authorizedUsersListIncludeNetworkUsers":  false,
    "authorizedUsersListHideAdminUsers":  false,
    "authorizedUsersListShowOtherManagedUsers":  false,
    "shutDownDisabled":  false,
    "restartDisabled":  false,
    "sleepDisabled":  false,
    "consoleAccessDisabled":  false,
    "shutDownDisabledWhileLoggedIn":  false,
    "restartDisabledWhileLoggedIn":  false,
    "powerOffDisabledWhileLoggedIn":  false,
    "logOutDisabledWhileLoggedIn":  false,
    "screenLockDisableImmediate":  false,
    "singleSignOnExtension":  null,
    "macOSSingleSignOnExtension":  null,
    "contentCachingEnabled":  false,
    "contentCachingType":  "notConfigured",
    "contentCachingMaxSizeBytes":  null,
    "contentCachingDataPath":  null,
    "contentCachingDisableConnectionSharing":  false,
    "contentCachingForceConnectionSharing":  false,
    "contentCachingClientPolicy":  "notConfigured",
    "contentCachingPeerPolicy":  "notConfigured",
    "contentCachingParentSelectionPolicy":  "notConfigured",
    "contentCachingParents":  [

                              ],
    "contentCachingLogClientIdentities":  false,
    "contentCachingBlockDeletion":  false,
    "contentCachingShowAlerts":  false,
    "contentCachingKeepAwake":  false,
    "contentCachingPort":  null,
    "airPrintDestinations":  [

                             ],
    "autoLaunchItems":  [

                        ],
    "associatedDomains":  [

                          ],
    "appAssociatedDomains":  [

                             ],
    "contentCachingClientListenRanges":  [

                                         ],
    "contentCachingPeerListenRanges":  [

                                       ],
    "contentCachingPeerFilterRanges":  [

                                       ],
    "contentCachingPublicRanges":  [

                                   ]
}
