{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  null,
    "displayName":  "Windows 10 - AAD Signin",
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "WEb Signin",
                            "description":  "0 Not configured 1 Allow 2 Block",
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/Authentication/EnableWebSignIn",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  2,
                            "isReadOnly":  false
                        }
                    ]
}
