{
    "@odata.type":  "#microsoft.graph.windows81SCEPCertificateProfile",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  null,
    "displayName":  "Windows 10 - AADJ WHB Cert",
    "renewalThresholdPercentage":  20,
    "keyStorageProvider":  "usePassportForWorkKspOtherwiseFail",
    "subjectNameFormat":  "custom",
    "subjectAlternativeNameType":  "none",
    "certificateValidityPeriodValue":  2,
    "certificateValidityPeriodScale":  "years",
    "scepServerUrls":  [
                           "https://ndes-thecliffords.msappproxy.net/certsrv/mscep/mscep.dll"
                       ],
    "subjectNameFormatString":  "CN={{OnPrem_Distinguished_Name}}",
    "keyUsage":  "keyEncipherment",
    "keySize":  "size2048",
    "hashAlgorithm":  "sha2",
    "subjectAlternativeNameFormatString":  null,
    "certificateStore":  "user",
    "extendedKeyUsages":  [
                              {
                                  "name":  "Smart Card Logon",
                                  "objectIdentifier":  "1.3.6.1.4.1.311.20.2.2"
                              }
                          ],
    "customSubjectAlternativeNames":  [
                                          {
                                              "sanType":  "userPrincipalName",
                                              "name":  "{{UserPrincipalName}}"
                                          }
                                      ]
}
