{
    "@odata.type":  "#microsoft.graph.windowsDeliveryOptimizationConfiguration",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  null,
    "displayName":  "Windows 10 - Delivery Optimization",
    "deliveryOptimizationMode":  "httpWithPeeringPrivateGroup",
    "restrictPeerSelectionBy":  "notConfigured",
    "groupIdSource":  null,
    "bandwidthMode":  null,
    "backgroundDownloadFromHttpDelayInSeconds":  300,
    "foregroundDownloadFromHttpDelayInSeconds":  60,
    "minimumRamAllowedToPeerInGigabytes":  4,
    "minimumDiskSizeAllowedToPeerInGigabytes":  32,
    "minimumFileSizeToCacheInMegabytes":  10,
    "minimumBatteryPercentageAllowedToUpload":  60,
    "modifyCacheLocation":  null,
    "maximumCacheAgeInDays":  7,
    "maximumCacheSize":  null,
    "vpnPeerCaching":  "notConfigured",
    "cacheServerHostNames":  [

                             ],
    "cacheServerForegroundDownloadFallbackToHttpDelayInSeconds":  0,
    "cacheServerBackgroundDownloadFallbackToHttpDelayInSeconds":  0
}
