{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description":  null,
    "displayName":  "Windows 10 - Update Compliance",
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingString",
                            "displayName":  "Commercial ID",
                            "description":  "Commercial ID",
                            "omaUri":  "./Vendor/MSFT/DMClient/Provider/ProviderID/CommercialID",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  "c5b1be23-1a57-45a9-b3b4-c1fe98a0e824"
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Telemerty Settings",
                            "description":  "Telemerty Settings",
                            "omaUri":  "./Vendor/MSFT/Policy/Config/System/AllowTelemetry",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  3,
                            "isReadOnly":  false
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Opt in settings",
                            "description":  "Opt in settings",
                            "omaUri":  "./Vendor/MSFT/Policy/Config/System/ConfigureTelemetryOptInSettingsUx",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        },
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingInteger",
                            "displayName":  "Allow PC Name",
                            "description":  "Allow PC Name",
                            "omaUri":  "./Vendor/MSFT/Policy/Config/System/AllowDeviceNameInDiagnosticData",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  1,
                            "isReadOnly":  false
                        }
                    ]
}
